app/views/home/_pkg_partial.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
<%= "Sender's details" %>
<% user=User.find(pkg.senders_id)%>