app/controllers/home_controller.rb

SELECT "packages".* FROM "packages"
---
	def index
@packages=Package.all

INSERT INTO "packages" ("pickup_time", "senders_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pickup_time", "2017-10-14 12:41:30.000000"], ["senders_id", 3], ["created_at", "2017-10-14 07:11:30.610665"], ["updated_at", "2017-10-14 07:11:30.610665"]]
---
 	def send_package
 		@package=Package.new
 		@package.weight=params["weight"]
 		@package.senders_address=params["senders_address"]
 		@package.recievers_address=params["recievers_address"]
 		@package.pickup_time=Time.now.to_s.split(" ")[0]+" "+Time.now.to_s.split(" ")[1]
 		# @package.distance=calculate distance
 		# @package.price=params["price"]
 		@package.recievers_phone_number = params["recievers_phone_number"]
 		@package.recievers_email=params["recievers_email"]
 		@package.senders_id=current_user.id
 		if @package.save

SELECT "packages".* FROM "packages"
---
 	def display_packages
 		@packages=Package.all